In [1]:
import pandas as pd
import numpy as np

# Pandas Data Structure => Series

In [2]:
obj = pd.Series([10,20,30])
obj

0    10
1    20
2    30
dtype: int64

In [3]:
type(obj)

pandas.core.series.Series

In [4]:
obj.values

array([10, 20, 30], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
obj1 = pd.Series([2,4,6,8,10],index=['a','b','c','d','e'])
obj1

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [8]:
obj1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
obj1['a']

2

In [11]:
obj1[['a','b','d']]

a    2
b    4
d    8
dtype: int64

In [12]:
#iltering with a boolean array
obj1[obj1>2]

b     4
c     6
d     8
e    10
dtype: int64

In [13]:
#scalar multiplication
obj1*2

a     4
b     8
c    12
d    16
e    20
dtype: int64

In [15]:
#using math functions
np.exp(obj1)

a        7.389056
b       54.598150
c      403.428793
d     2980.957987
e    22026.465795
dtype: float64

The exponential function is e^x where e is a mathematical constant called Euler's number, approximately 2.718281. This value has a close mathematical relationship with pi and the slope of the curve e^x is equal to its value at every point. np.exp() calculates e^x for each value of x in your input array.

In [16]:
'b' in obj1

True

In [17]:
'z' in obj1

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
#key of dict become the index of series
obj2 = pd.Series(sdata)
obj2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
#using our own index
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj3 = pd.Series(sdata , index=states)
obj3

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
#isnull and notnull functions to detect missing values
pd.isnull(obj3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj3)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
#Series also has these as instance methods
obj3.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
#automatically aligns by index label in arithmetic operations
obj2+obj3
#basically it is working like a join as we use in database

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj3.name = 'Population'
obj3.index.name = 'State'
obj3

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [29]:
#A Seriesâ€™s index can be altered in-place by assignment
obj

0    10
1    20
2    30
dtype: int64

In [31]:
obj.index = ['Anas','Bilal','Khizram']
obj

Anas       10
Bilal      20
Khizram    30
dtype: int64

# Pandas Data Structure => DataFrame

In [60]:
#creating dataframe by dictionary
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [61]:
#head method use to select first 5 rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [62]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [63]:
#tail select last 5 rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [64]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [65]:
#specifying the sequence of columns
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [66]:
#debt is not in dict so it will contain missing values
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [67]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [69]:
#A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [70]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [71]:
#to retrive rows
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [72]:
#assigning scalar value to debt column
frame2['debt'] = 10.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [73]:
#assigning array to debt column
frame2['debt'] = np.arange(len(frame2))
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [74]:
#assigning values at particular indexs
values = pd.Series([1.5,2.5,3.5],index=['one','three','five'])
frame2['debt'] = values
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.5
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   2.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   3.5
six    2003  Nevada  3.2   NaN

In [75]:
#creating new column with boolean values
frame2['eastren'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastren
one    2000    Ohio  1.5   1.5     True
two    2001    Ohio  1.7   NaN     True
three  2002    Ohio  3.6   2.5     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   3.5    False
six    2003  Nevada  3.2   NaN    False

In [78]:
#deleting a column
del frame2['eastren']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.5
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   2.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   3.5
six    2003  Nevada  3.2   NaN

In [79]:
#creating dataframe by using nested dict
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [80]:
#transpose
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [81]:
#in nested dict the keys / index are in sorted form
pd.DataFrame(pop,index=[2001,2000,2002])

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [82]:
#dataframe thorught dict of series
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [84]:
frame3.index.name = 'Year'
frame3.columns.name = 'State'
frame3

State  Nevada  Ohio
Year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [85]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [86]:
frame2.values #if dataframe cloumns are of different dtype

array([[2000, 'Ohio', 1.5, 1.5],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, 2.5],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, 3.5],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# Index Objects

In [87]:
obj = pd.Series(range(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [88]:
index[1:]

Index(['b', 'c'], dtype='object')

In [89]:
index[1] = 'a' #indexs are immutable

TypeError: Index does not support mutable operations

In [92]:
#Immutability makes it safer to share Index objects among data structures
label = pd.Index(np.arange(3))
obj2 = pd.Series([10,20,30],index=label)
obj2

0    10
1    20
2    30
dtype: int64

In [93]:
obj2.index is label

True

In [95]:
#Unlike Python sets, a pandas Index can contain duplicate labels
duplabel = pd.Index(['foo','foo','hello','hello','hello'])
duplabel

Index(['foo', 'foo', 'hello', 'hello', 'hello'], dtype='object')

# Essential Functionality

## Reindexing

In [99]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [101]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [102]:
#if we want to fill missing values while reindexing and series object we can use a method 'ffill'
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [103]:
obj3.reindex(range(6),method='ffill') #ffill = forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [104]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [106]:
#redindexing row 
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [107]:
#reindexing columns
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [108]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\HP\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## Dropping Entries from an Axis

In [109]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj.drop(['a','e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [112]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
#dropping index in dataframe
data.drop(['Ohio','Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [114]:
#You can drop values from the columns by passing axis=1 or axis='columns'
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [115]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [116]:
obj.drop('c', inplace=True)  #to make changes in that object not making a new
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection, and Filtering

In [117]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [118]:
obj['b']

1.0

In [119]:
obj[1]

1.0

In [120]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [121]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [122]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [123]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [125]:
obj['b':'c']  #slicing with labels the end point is inclusive

b    1.0
c    2.0
dtype: float64

In [127]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [130]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [131]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [132]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [136]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection with loc and iloc

In [137]:
data.loc['Colorado', ['two', 'three']]  #selecting 1 row and 2 columns

two      5
three    6
Name: Colorado, dtype: int32

In [139]:
#performing same task by integers
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [140]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [141]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [142]:
#both loc and iloc can work with silicing
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [143]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## Integer Indexes

In [145]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [146]:
ser[-1] #generate error on integer index

KeyError: -1

In [147]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [148]:
ser2[-1]  #work properly with non integer index

2.0

In [149]:
ser[:1]

0    0.0
dtype: float64

In [150]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [151]:
ser.iloc[:1]

0    0.0
dtype: float64

In [152]:
ser.iloc[-1]

2.0

## Arithmetic and Data Alignment

In [153]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [154]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [155]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [156]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [157]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [158]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [159]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [160]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [161]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[2,3]})

In [162]:
df1

   A
0  1
1  2

In [163]:
df2

   B
0  2
1  3

In [164]:
df2-df1

    A   B
0 NaN NaN
1 NaN NaN

## Arithmetic methods with fill values

In [165]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [166]:
df2.loc[1,'b'] = np.NaN

In [167]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [168]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [169]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [170]:
#to fill nan value using add method for addition
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [171]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [172]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [173]:
#we can use fill_value function in reindexing
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## Operations between DataFrame and Series

In [174]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [176]:
frame-series  
#By default, arithmetic between DataFrame and Series matches the index of the Series
#on the DataFrameâ€™s columns, broadcasting down the rows

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [177]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [179]:
frame+series2 #with differnet index of series  f

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [180]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [181]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [182]:
frame.sub(series3,axis='index')  #broadcasting

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

In [183]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.097780 -0.696033 -0.374918
Ohio    1.374413 -1.948517  0.953310
Texas  -0.030247 -1.801021  0.426256
Oregon -1.116287 -2.558386  1.195101

In [184]:
np.abs(frame)

               b         d         e
Utah    1.097780  0.696033  0.374918
Ohio    1.374413  1.948517  0.953310
Texas   0.030247  1.801021  0.426256
Oregon  1.116287  2.558386  1.195101

In [186]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.490700
d    1.862354
e    1.570019
dtype: float64

In [187]:
frame.apply(f,axis='columns')

Utah      0.722862
Ohio      3.322930
Texas     2.227277
Oregon    3.753487
dtype: float64

In [188]:
def f(x):
     return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.116287 -2.558386 -0.374918
max  1.374413 -0.696033  1.195101

In [189]:
_format = lambda x: '%.2f' % x
frame.applymap(_format) #applymap will appy the function or all values of dataframne

            b      d      e
Utah    -1.10  -0.70  -0.37
Ohio     1.37  -1.95   0.95
Texas   -0.03  -1.80   0.43
Oregon  -1.12  -2.56   1.20

In [190]:
#The reason for the name applymap is that Series has a map method for applying an
#element-wise function
frame['e'].map(_format)

Utah      -0.37
Ohio       0.95
Texas      0.43
Oregon     1.20
Name: e, dtype: object

# Sorting and Ranking

In [191]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [193]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [194]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [195]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [196]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [199]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [200]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [201]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [202]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [203]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [204]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [205]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [206]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [2]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [208]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [209]:
#Ranks can also be assigned according to the order in which theyâ€™re observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [3]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [4]:
#Ranking in dataframe
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [5]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [7]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [8]:
frame.rank(axis='index')

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

## Axis Indexes with Duplicate Labels

In [9]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [10]:
obj.index.is_unique

False

In [11]:
obj['a']

a    0
a    1
dtype: int64

In [12]:
obj['c']

4

In [13]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.851644 -1.695542  1.618684
a  0.108459  0.041849  1.169342
b -0.448201 -0.096119 -0.437306
b -0.131232  2.252620  0.571410

In [18]:
df.loc['a']

          0         1         2
a -1.851644 -1.695542  1.618684
a  0.108459  0.041849  1.169342

# Summarizing and Computing Descriptive Statistics

In [19]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                     [np.nan, np.nan], [0.75, -1.3]],
                     index=['a', 'b', 'c', 'd'],
                     columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [20]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [21]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [23]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [24]:
#NA values are excluded unless the entire slice (row or column in this case) is NA.
#This can be disabled with the skipna option
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [26]:
df.idxmax() #return id of max value

one    b
two    d
dtype: object

In [27]:
df.idxmin()

one    d
two    b
dtype: object

In [28]:
df.idxmax(axis='columns')

a    one
b    one
c    NaN
d    one
dtype: object

In [29]:
df.cumsum() #accumulation 1.40+7.10 = 8.50 => 8.50+0.75 = 9.25

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [30]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [31]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [32]:
obj.describe()  #non- numeric data

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance

In [33]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
all_data

{'AAPL':                   High         Low        Open       Close      Volume  \
 Date
 2014-11-17  117.279999  113.300003  114.269997  113.989998  46746700.0
 2014-11-18  115.690002  113.889999  113.940002  115.470001  44224000.0
 2014-11-19  115.739998  113.800003  115.440002  114.669998  41869200.0
 2014-11-20  116.860001  114.849998  114.910004  116.309998  43395500.0
 2014-11-21  117.570000  116.029999  117.510002  116.470001  57179300.0
 2014-11-24  118.769997  116.620003  116.849998  118.629997  47450800.0
 2014-11-25  119.750000  117.449997  119.070000  117.599998  68840400.0
 2014-11-26  119.099998  117.830002  117.940002  119.000000  40768300.0
 2014-11-28  119.400002  118.050003  119.269997  118.930000  24814400.0
 2014-12-01  119.250000  111.269997  118.809998  115.070000  83814000.0
 2014-12-02  115.750000  112.750000  113.500000  114.629997  59348900.0
 2014-12-03  116.349998  115.110001  115.750000  115.930000  43063400.0
 2014-12-04  117.199997  115.290001  115.769997  115.489998  42044500.0
 2014-12-05  116.080002  114.639999  115.989998  115.000000  38318900.0
 2014-12-08  114.650002  111.620003  114.099998  112.400002  57664900.0
 2014-12-09  114.300003  109.349998  110.190002  114.120003  60208000.0
 2014-12-10  114.849998  111.540001  114.410004  111.949997  44565300.0
 2014-12-11  113.800003  111.339996  112.260002  111.620003  41401700.0
 2014-12-12  111.870003  109.580002  110.459999  109.730003  56028100.0
 2014-12-15  111.599998  106.349998  110.699997  108.230003  67218100.0
 2014-12-16  110.160004  106.260002  106.370003  106.750000  60790700.0
 2014-12-17  109.839996  106.820000  107.120003  109.410004  53411800.0
 2014-12-18  112.650002  110.660004  111.870003  112.650002  59006200.0
 2014-12-19  113.239998  111.660004  112.260002  111.779999  88429800.0
 2014-12-22  113.489998  111.970001  112.160004  112.940002  45167500.0
 2014-12-23  113.330002  112.459999  113.230003  112.540001  26028400.0
 2014-12-24  112.709999  112.010002  112.580002  112.010002  14479600.0
 2014-12-26  114.519997  112.010002  112.099998  113.989998  33721000.0
 2014-12-29  114.769997  113.699997  113.790001  113.910004  27598900.0
 2014-12-30  113.919998  112.110001  113.639999  112.519997  29881500.0
 ...                ...         ...         ...         ...         ...
 2019-10-07  229.929993  225.839996  226.270004  227.059998  30576500.0
 2019-10-08  228.059998  224.330002  225.820007  224.399994  27955000.0
 2019-10-09  227.789993  225.639999  227.029999  227.029999  18692600.0
 2019-10-10  230.440002  227.300003  227.929993  230.089996  28253400.0
 2019-10-11  237.639999  232.309998  232.949997  236.210007  41698900.0
 2019-10-14  238.130005  234.669998  234.899994  235.869995  24106900.0
 2019-10-15  237.649994  234.880005  236.389999  235.320007  21840000.0
 2019-10-16  235.240005  233.199997  233.369995  234.369995  18475800.0
 2019-10-17  236.149994  233.520004  235.089996  235.279999  16896300.0
 2019-10-18  237.580002  234.289993  234.589996  236.410004  24358400.0
 2019-10-21  240.990005  237.320007  237.520004  240.509995  21811800.0
 2019-10-22  242.199997  239.619995  241.160004  239.960007  20573400.0
 2019-10-23  243.240005  241.220001  242.100006  243.179993  18957200.0
 2019-10-24  244.800003  241.809998  244.509995  243.580002  17318800.0
 2019-10-25  246.729996  242.880005  243.160004  246.580002  18369300.0
 2019-10-28  249.250000  246.720001  247.419998  249.050003  24143200.0
 2019-10-29  249.750000  242.570007  248.970001  243.289993  35709900.0
 2019-10-30  245.300003  241.210007  244.759995  243.259995  31130500.0
 2019-10-31  249.169998  237.259995  247.240005  248.759995  34790500.0
 2019-11-01  255.929993  249.160004  249.539993  255.820007  37781300.0
 2019-11-04  257.850006  255.380005  257.329987  257.500000  25818000.0
 2019-11-05  258.190002  256.320007  257.049988  257.130005  19974400.0
 2019-11-06  257.489990  255.369995  256.769989  257.239990  18966100.0
 2019-11-07  260.350006  258.109985  258.739990  259.429993  23735100.0
 2019-11-08  260.440002  256.850006  258.690002  260.140015  17496600.0
 2019-11-11  262.470001  258.279999  258.299988  262.200012  20455300.0
 2019-11-12  262.790009  260.920013  261.549988  261.959991  21847200.0
 2019-11-13  264.779999  261.070007  261.130005  264.470001  25683600.0
 2019-11-14  264.880005  262.100006  263.750000  262.640015  22295700.0
 2019-11-15  265.779999  263.010010  263.679993  265.760010  25051600.0

              Adj Close
 Date
 2014-11-17  104.735992
 2014-11-18  106.095840
 2014-11-19  105.360786
 2014-11-20  106.867630
 2014-11-21  107.014664
 2014-11-24  108.999298
 2014-11-25  108.052910
 2014-11-26  109.339249
 2014-11-28  109.274948
 2014-12-01  105.728317
 2014-12-02  105.324020
 2014-12-03  106.518494
 2014-12-04  106.114204
 2014-12-05  105.663986
 2014-12-08  103.275063
 2014-12-09  104.855431
 2014-12-10  102.861610
 2014-12-11  102.558395
 2014-12-12  100.821831
 2014-12-15   99.443619
 2014-12-16   98.083740
 2014-12-17  100.527809
 2014-12-18  103.504761
 2014-12-19  102.705391
 2014-12-22  103.771225
 2014-12-23  103.403709
 2014-12-24  102.916725
 2014-12-26  104.735992
 2014-12-29  104.662506
 2014-12-30  103.385315
 ...                ...
 2019-10-07  226.380341
 2019-10-08  223.728302
 2019-10-09  226.350433
 2019-10-10  229.401276
 2019-10-11  235.502960
 2019-10-14  235.163971
 2019-10-15  234.615631
 2019-10-16  233.668457
 2019-10-17  234.575745
 2019-10-18  235.702362
 2019-10-21  239.790085
 2019-10-22  239.241745
 2019-10-23  242.452087
 2019-10-24  242.850891
 2019-10-25  245.841919
 2019-10-28  248.304520
 2019-10-29  242.561752
 2019-10-30  242.531845
 2019-10-31  248.015381
 2019-11-01  255.054260
 2019-11-04  256.729218
 2019-11-05  256.360352
 2019-11-06  256.470001
 2019-11-07  259.429993
 2019-11-08  260.140015
 2019-11-11  262.200012
 2019-11-12  261.959991
 2019-11-13  264.470001
 2019-11-14  262.640015
 2019-11-15  265.760010

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2014-11-17  164.970001  163.720001  164.160004  164.160004   4798900.0
 2014-11-18  164.750000  161.889999  164.729996  161.889999   5410100.0
 2014-11-19  162.100006  160.960007  162.050003  161.429993   3802600.0
 2014-11-20  161.500000  159.800003  160.949997  160.639999   4183100.0
 2014-11-21  161.949997  160.750000  161.830002  160.919998   4076900.0
 2014-11-24  163.860001  161.059998  161.539993  162.149994   6619000.0
 2014-11-25  163.500000  161.559998  162.649994  161.759995   4062400.0
 2014-11-26  162.100006  161.009995  161.929993  161.949997   3966000.0
 2014-11-28  163.369995  161.440002  162.750000  162.169998   2405500.0
 2014-12-01  163.320007  161.350006  161.639999  161.539993   4168400.0
 2014-12-02  162.729996  161.639999  162.470001  162.669998   3465700.0
 2014-12-03  164.520004  162.000000  162.470001  164.520004   6429100.0
 2014-12-04  164.500000  163.009995  164.009995  164.050003   3859400.0
 2014-12-05  164.500000  162.910004  163.610001  163.270004   3013500.0
 2014-12-08  163.289993  161.539993  163.289993  161.860001   2851000.0
 2014-12-09  163.020004  160.800003  160.839996  162.990005   3861200.0
 2014-12-10  163.330002  160.029999  163.009995  160.509995   4072800.0
 2014-12-11  162.929993  160.520004  160.820007  161.070007   3989600.0
 2014-12-12  160.500000  155.330002  160.250000  155.380005   8611700.0
 2014-12-15  156.740005  152.839996  155.929993  153.059998   6500300.0
 2014-12-16  154.889999  150.500000  152.029999  151.410004   6782600.0
 2014-12-17  153.309998  151.110001  151.520004  151.929993   5131000.0
 2014-12-18  157.679993  153.300003  153.580002  157.679993   7302400.0
 2014-12-19  160.410004  157.490005  157.490005  158.509995   8864900.0
 2014-12-22  161.910004  158.330002  158.330002  161.440002   4682500.0
 2014-12-23  162.899994  161.610001  162.229996  162.240005   4043300.0
 2014-12-24  162.990005  161.610001  162.880005  161.820007   1868100.0
 2014-12-26  163.089996  162.009995  162.270004  162.339996   1912200.0
 2014-12-29  162.339996  159.449997  162.000000  160.509995   3331800.0
 2014-12-30  160.820007  159.789993  160.020004  160.050003   2829900.0
 ...                ...         ...         ...         ...         ...
 2019-10-07  142.699997  141.220001  142.259995  141.279999   2426500.0
 2019-10-08  140.470001  138.250000  140.240005  138.380005   3225400.0
 2019-10-09  140.330002  138.789993  139.770004  139.669998   2620800.0
 2019-10-10  141.779999  139.559998  139.770004  141.130005   2593700.0
 2019-10-11  144.500000  142.610001  142.770004  142.759995   2996800.0
 2019-10-14  142.429993  141.320007  142.309998  142.039993   2309500.0
 2019-10-15  143.720001  141.809998  142.539993  143.000000   3025500.0
 2019-10-16  142.949997  141.389999  142.490005  142.110001   5332600.0
 2019-10-17  136.000000  132.910004  135.000000  134.259995  15759800.0
 2019-10-18  134.490005  132.250000  134.220001  134.089996   7177500.0
 2019-10-21  133.100006  130.899994  132.610001  132.580002   6306100.0
 2019-10-22  134.050003  131.610001  132.550003  133.960007   4161600.0
 2019-10-23  134.570007  132.699997  133.520004  134.380005   3610900.0
 2019-10-24  135.070007  133.300003  134.830002  134.070007   2598500.0
 2019-10-25  135.929993  134.100006  134.119995  135.440002   2579100.0
 2019-10-28  136.630005  135.449997  136.000000  135.970001   3225700.0
 2019-10-29  135.570007  133.440002  135.419998  133.820007   4160700.0
 2019-10-30  135.279999  133.199997  133.830002  135.250000   2252700.0
 2019-10-31  135.250000  133.229996  135.110001  133.729996   3412100.0
 2019-11-01  135.559998  134.089996  134.500000  135.529999   3089800.0
 2019-11-04  137.740005  136.229996  136.240005  137.669998   3335400.0
 2019-11-05  138.759995  137.630005  137.800003  137.889999   3015000.0
 2019-11-06  138.779999  137.550003  138.000000  138.779999   4477300.0
 2019-11-07  139.139999  137.580002  137.869995  137.690002   4073800.0
 2019-11-08  137.610001  136.160004  137.580002  137.610001   2278400.0
 2019-11-11  137.199997  135.000000  137.199997  135.470001   2568000.0
 2019-11-12  136.660004  135.020004  135.869995  135.589996   3046500.0
 2019-11-13  135.580002  133.850006  135.389999  134.479996   2918400.0
 2019-11-14  134.330002  133.330002  134.130005  134.000000   4231300.0
 2019-11-15  135.119995  134.029999  134.389999  134.399994   3262500.0

              Adj Close
 Date
 2014-11-17  132.283310
 2014-11-18  130.454056
 2014-11-19  130.083374
 2014-11-20  129.446808
 2014-11-21  129.672424
 2014-11-24  130.663605
 2014-11-25  130.349304
 2014-11-26  130.502426
 2014-11-28  130.679733
 2014-12-01  130.172043
 2014-12-02  131.082611
 2014-12-03  132.573410
 2014-12-04  132.194687
 2014-12-05  131.566116
 2014-12-08  130.429932
 2014-12-09  131.340530
 2014-12-10  129.342056
 2014-12-11  129.793335
 2014-12-12  125.208199
 2014-12-15  123.338692
 2014-12-16  122.009132
 2014-12-17  122.428116
 2014-12-18  127.061554
 2014-12-19  127.730415
 2014-12-22  130.091492
 2014-12-23  130.736130
 2014-12-24  130.397690
 2014-12-26  130.816681
 2014-12-29  129.342056
 2014-12-30  128.971390
 ...                ...
 2019-10-07  139.630814
 2019-10-08  136.764679
 2019-10-09  138.039612
 2019-10-10  139.482574
 2019-10-11  141.093536
 2019-10-14  140.381943
 2019-10-15  141.330734
 2019-10-16  140.451126
 2019-10-17  132.692764
 2019-10-18  132.524750
 2019-10-21  131.032379
 2019-10-22  132.396271
 2019-10-23  132.811371
 2019-10-24  132.504990
 2019-10-25  133.858994
 2019-10-28  134.382797
 2019-10-29  132.257904
 2019-10-30  133.671204
 2019-10-31  132.168945
 2019-11-01  133.947937
 2019-11-04  136.062958
 2019-11-05  136.280396
 2019-11-06  137.160004
 2019-11-07  137.690002
 2019-11-08  137.610001
 2019-11-11  135.470001
 2019-11-12  135.589996
 2019-11-13  134.479996
 2019-11-14  134.000000
 2019-11-15  134.399994

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2014-11-17   49.709999   49.139999   49.410000   49.459999  30318600.0
 2014-11-18   49.330002   48.700001   49.130001   48.740002  23995500.0
 2014-11-19   48.750000   47.930000   48.660000   48.220001  26177500.0
 2014-11-20   48.700001   47.869999   48.000000   48.700001  21510600.0
 2014-11-21   49.049999   47.570000   49.020000   47.980000  42884800.0
 2014-11-24   48.000000   47.389999   47.990002   47.590000  35434200.0
 2014-11-25   47.970001   47.450001   47.660000   47.470001  28008000.0
 2014-11-26   47.990002   47.279999   47.490002   47.750000  27163600.0
 2014-11-28   48.200001   47.610001   47.950001   47.810001  21534400.0
 2014-12-01   48.779999   47.709999   47.880001   48.619999  31191600.0
 2014-12-02   49.049999   48.200001   48.840000   48.459999  25773500.0
 2014-12-03   48.500000   47.810001   48.439999   48.080002  23534800.0
 2014-12-04   49.060001   48.200001   48.389999   48.840000  30320400.0
 2014-12-05   48.970001   48.380001   48.820000   48.419998  27313400.0
 2014-12-08   48.349998   47.450001   48.259998   47.700001  26663100.0
 2014-12-09   47.919998   47.049999   47.110001   47.590000  24330500.0
 2014-12-10   47.660000   46.700001   47.580002   46.900002  30431800.0
 2014-12-11   47.740002   46.680000   47.080002   47.169998  29060400.0
 2014-12-12   47.730000   46.669998   46.779999   46.950001  34248400.0
 2014-12-15   47.669998   46.549999   47.200001   46.669998  29247800.0
 2014-12-16   46.340000   45.130001   45.900002   45.160000  47801400.0
 2014-12-17   45.950001   44.900002   45.049999   45.740002  34970900.0
 2014-12-18   47.520000   46.340000   46.580002   47.520000  40105600.0
 2014-12-19   48.099998   47.169998   47.630001   47.660000  64551200.0
 2014-12-22   48.119999   47.709999   47.779999   47.980000  26566000.0
 2014-12-23   48.799999   48.130001   48.369999   48.450001  23648100.0
 2014-12-24   48.639999   48.080002   48.639999   48.139999  11437800.0
 2014-12-26   48.410000   47.820000   48.410000   47.880001  13197800.0
 2014-12-29   47.779999   47.259998   47.700001   47.450001  14439500.0
 2014-12-30   47.619999   46.840000   47.439999   47.020000  16384700.0
 ...                ...         ...         ...         ...         ...
 2019-10-07  138.179993  137.020004  137.139999  137.119995  15303700.0
 2019-10-08  137.759995  135.619995  137.080002  135.669998  25550500.0
 2019-10-09  138.699997  136.970001  137.460007  138.240005  19749900.0
 2019-10-10  139.669998  138.250000  138.490005  139.100006  17654600.0
 2019-10-11  141.029999  139.500000  140.119995  139.679993  25446000.0
 2019-10-14  140.289993  139.520004  139.690002  139.550003  13304300.0
 2019-10-15  141.789993  139.809998  140.059998  141.570007  19695700.0
 2019-10-16  140.990005  139.529999  140.789993  140.410004  20751600.0
 2019-10-17  141.419998  139.020004  140.949997  139.690002  21460600.0
 2019-10-18  140.000000  136.559998  139.759995  137.410004  32273500.0
 2019-10-21  138.500000  137.009995  138.449997  138.429993  20078200.0
 2019-10-22  140.009995  136.259995  138.970001  136.369995  27431000.0
 2019-10-23  137.449997  135.610001  136.880005  137.240005  29844600.0
 2019-10-24  140.419998  138.669998  139.389999  139.940002  37029300.0
 2019-10-25  141.139999  139.199997  139.339996  140.729996  25959700.0
 2019-10-28  145.669998  143.509995  144.399994  144.190002  35280100.0
 2019-10-29  144.500000  142.649994  144.080002  142.830002  20589500.0
 2019-10-30  145.000000  142.789993  143.520004  144.610001  18496600.0
 2019-10-31  144.929993  142.990005  144.899994  143.369995  24605100.0
 2019-11-01  144.419998  142.970001  144.259995  143.720001  33128400.0
 2019-11-04  145.000000  144.160004  144.830002  144.550003  16912000.0
 2019-11-05  145.020004  143.910004  144.970001  144.460007  18250200.0
 2019-11-06  144.520004  143.199997  144.369995  144.059998  16575800.0
 2019-11-07  144.880005  143.770004  143.839996  144.259995  17786700.0
 2019-11-08  145.990005  143.759995  143.979996  145.960007  16732700.0
 2019-11-11  146.419998  144.729996  145.339996  146.110001  14362600.0
 2019-11-12  147.570007  146.059998  146.279999  147.070007  18641600.0
 2019-11-13  147.460007  146.279999  146.740005  147.309998  16919200.0
 2019-11-14  148.410004  147.000000  147.020004  148.059998  19729800.0
 2019-11-15  149.990005  148.270004  148.929993  149.970001  23485700.0

              Adj Close
 Date
 2014-11-17   44.274975
 2014-11-18   43.905632
 2014-11-19   43.437222
 2014-11-20   43.869606
 2014-11-21   43.221031
 2014-11-24   42.869705
 2014-11-25   42.761612
 2014-11-26   43.013840
 2014-11-28   43.067890
 2014-12-01   43.797543
 2014-12-02   43.653416
 2014-12-03   43.311108
 2014-12-04   43.995720
 2014-12-05   43.617382
 2014-12-08   42.968800
 2014-12-09   42.869705
 2014-12-10   42.248138
 2014-12-11   42.491364
 2014-12-12   42.293186
 2014-12-15   42.040955
 2014-12-16   40.680733
 2014-12-17   41.203209
 2014-12-18   42.806644
 2014-12-19   42.932766
 2014-12-22   43.221031
 2014-12-23   43.644402
 2014-12-24   43.365158
 2014-12-26   43.130943
 2014-12-29   42.743599
 2014-12-30   42.356247
 ...                ...
 2019-10-07  137.119995
 2019-10-08  135.669998
 2019-10-09  138.240005
 2019-10-10  139.100006
 2019-10-11  139.679993
 2019-10-14  139.550003
 2019-10-15  141.570007
 2019-10-16  140.410004
 2019-10-17  139.690002
 2019-10-18  137.410004
 2019-10-21  138.429993
 2019-10-22  136.369995
 2019-10-23  137.240005
 2019-10-24  139.940002
 2019-10-25  140.729996
 2019-10-28  144.190002
 2019-10-29  142.830002
 2019-10-30  144.610001
 2019-10-31  143.369995
 2019-11-01  143.720001
 2019-11-04  144.550003
 2019-11-05  144.460007
 2019-11-06  144.059998
 2019-11-07  144.259995
 2019-11-08  145.960007
 2019-11-11  146.110001
 2019-11-12  147.070007
 2019-11-13  147.309998
 2019-11-14  148.059998
 2019-11-15  149.970001

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close     Volume  \
 Date
 2014-11-17   542.301086   532.598755   542.091675   535.041016  1726000.0
 2014-11-18   540.456177   532.707458   536.028320   533.565125  1962600.0
 2014-11-19   536.766296   528.628662   533.535156   535.519714  1392200.0
 2014-11-20   533.644897   529.625916   529.795471   533.365662  1563300.0
 2014-11-21   540.655640   535.090881   540.127075   536.028320  2224200.0
 2014-11-24   541.214111   534.153503   536.177917   537.793518  1706300.0
 2014-11-25   542.490601   537.127319   537.524231   539.598511  1789900.0
 2014-11-26   540.067261   535.571594   539.399109   538.890503  1522900.0
 2014-11-28   540.515991   535.130798   539.139771   540.346497  1148300.0
 2014-12-01   539.927612   530.403748   537.424500   532.338440  2115300.0
 2014-12-02   534.033813   528.349426   532.049255   532.288574  1526600.0
 2014-12-03   534.528442   527.810913   529.984924   529.865234  1277900.0
 2014-12-04   535.868774   527.142700   529.705688   535.838867  1392100.0
 2014-12-05   531.430969   522.844543   529.546143   523.821838  2565600.0
 2014-12-08   529.546143   522.355896   525.686707   525.537109  2329300.0
 2014-12-09   532.727417   519.074890   520.710388   531.909668  1871300.0
 2014-12-10   534.861511   524.121033   531.620422   524.619629  1712200.0
 2014-12-11   532.458130   525.656799   526.354919   526.893433  1610800.0
 2014-12-12   527.052979   517.239929   522.076660   517.239929  1994500.0
 2014-12-15   521.667786   511.864685   521.308777   512.393250  2813400.0
 2014-12-16   511.645264   487.661133   510.159363   494.033630  3964200.0
 2014-12-17   505.611847   495.449738   495.639221   503.507629  2883100.0
 2014-12-18   512.463013   503.318146   511.545563   509.700623  2926700.0
 2014-12-19   516.302490   505.523071   510.109497   514.936218  3690200.0
 2014-12-22   525.018555   514.666992   514.666992   523.432922  2723700.0

In [35]:
price = pd.DataFrame({ticker: data['Adj Close']
            for ticker, data in all_data.items()})
price

                  AAPL         IBM        MSFT         GOOG
Date
2014-11-17  104.735992  132.283310   44.274975   535.041016
2014-11-18  106.095840  130.454056   43.905632   533.565125
2014-11-19  105.360786  130.083374   43.437222   535.519714
2014-11-20  106.867630  129.446808   43.869606   533.365662
2014-11-21  107.014664  129.672424   43.221031   536.028320
2014-11-24  108.999298  130.663605   42.869705   537.793518
2014-11-25  108.052910  130.349304   42.761612   539.598511
2014-11-26  109.339249  130.502426   43.013840   538.890503
2014-11-28  109.274948  130.679733   43.067890   540.346497
2014-12-01  105.728317  130.172043   43.797543   532.338440
2014-12-02  105.324020  131.082611   43.653416   532.288574
2014-12-03  106.518494  132.573410   43.311108   529.865234
2014-12-04  106.114204  132.194687   43.995720   535.838867
2014-12-05  105.663986  131.566116   43.617382   523.821838
2014-12-08  103.275063  130.429932   42.968800   525.537109
2014-12-09  104.855431  131.340530   42.869705   531.909668
2014-12-10  102.861610  129.342056   42.248138   524.619629
2014-12-11  102.558395  129.793335   42.491364   526.893433
2014-12-12  100.821831  125.208199   42.293186   517.239929
2014-12-15   99.443619  123.338692   42.040955   512.393250
2014-12-16   98.083740  122.009132   40.680733   494.033630
2014-12-17  100.527809  122.428116   41.203209   503.507629
2014-12-18  103.504761  127.061554   42.806644   509.700623
2014-12-19  102.705391  127.730415   42.932766   514.936218
2014-12-22  103.771225  130.091492   43.221031   523.432922
2014-12-23  103.403709  130.736130   43.644402   529.137268
2014-12-24  102.916725  130.397690   43.365158   527.322266
2014-12-26  104.735992  130.816681   43.130943   532.567810
2014-12-29  104.662506  129.342056   42.743599   528.877991
2014-12-30  103.385315  128.971390   42.356247   528.967712
...                ...         ...         ...          ...
2019-10-07  226.380341  139.630814  137.119995  1207.680054
2019-10-08  223.728302  136.764679  135.669998  1189.130005
2019-10-09  226.350433  138.039612  138.240005  1202.310059
2019-10-10  229.401276  139.482574  139.100006  1208.670044
2019-10-11  235.502960  141.093536  139.679993  1215.449951
2019-10-14  235.163971  140.381943  139.550003  1217.140015
2019-10-15  234.615631  141.330734  141.570007  1243.010010
2019-10-16  233.668457  140.451126  140.410004  1243.640015
2019-10-17  234.575745  132.692764  139.690002  1253.069946
2019-10-18  235.702362  132.524750  137.410004  1245.489990
2019-10-21  239.790085  131.032379  138.429993  1246.150024
2019-10-22  239.241745  132.396271  136.369995  1242.800049
2019-10-23  242.452087  132.811371  137.240005  1259.130005
2019-10-24  242.850891  132.504990  139.940002  1260.989990
2019-10-25  245.841919  133.858994  140.729996  1265.130005
2019-10-28  248.304520  134.382797  144.190002  1290.000000
2019-10-29  242.561752  132.257904  142.830002  1262.619995
2019-10-30  242.531845  133.671204  144.610001  1261.290039
2019-10-31  248.015381  132.168945  143.369995  1260.109985
2019-11-01  255.054260  133.947937  143.720001  1273.739990
2019-11-04  256.729218  136.062958  144.550003  1291.369995
2019-11-05  256.360352  136.280396  144.460007  1292.030029
2019-11-06  256.470001  137.160004  144.059998  1291.800049
2019-11-07  259.429993  137.690002  144.259995  1308.859985
2019-11-08  260.140015  137.610001  145.960007  1311.369995
2019-11-11  262.200012  135.470001  146.110001  1299.189941
2019-11-12  261.959991  135.589996  147.070007  1298.800049
2019-11-13  264.470001  134.479996  147.309998  1298.000000
2019-11-14  262.640015  134.000000  148.059998  1311.459961
2019-11-15  265.760010  134.399994  149.970001  1334.869995

[1259 rows x 4 columns]

In [36]:
volume = pd.DataFrame({ticker: data['Volume']
            for ticker, data in all_data.items()})
volume

                  AAPL         IBM        MSFT       GOOG
Date
2014-11-17  46746700.0   4798900.0  30318600.0  1726000.0
2014-11-18  44224000.0   5410100.0  23995500.0  1962600.0
2014-11-19  41869200.0   3802600.0  26177500.0  1392200.0
2014-11-20  43395500.0   4183100.0  21510600.0  1563300.0
2014-11-21  57179300.0   4076900.0  42884800.0  2224200.0
2014-11-24  47450800.0   6619000.0  35434200.0  1706300.0
2014-11-25  68840400.0   4062400.0  28008000.0  1789900.0
2014-11-26  40768300.0   3966000.0  27163600.0  1522900.0
2014-11-28  24814400.0   2405500.0  21534400.0  1148300.0
2014-12-01  83814000.0   4168400.0  31191600.0  2115300.0
2014-12-02  59348900.0   3465700.0  25773500.0  1526600.0
2014-12-03  43063400.0   6429100.0  23534800.0  1277900.0
2014-12-04  42044500.0   3859400.0  30320400.0  1392100.0
2014-12-05  38318900.0   3013500.0  27313400.0  2565600.0
2014-12-08  57664900.0   2851000.0  26663100.0  2329300.0
2014-12-09  60208000.0   3861200.0  24330500.0  1871300.0
2014-12-10  44565300.0   4072800.0  30431800.0  1712200.0
2014-12-11  41401700.0   3989600.0  29060400.0  1610800.0
2014-12-12  56028100.0   8611700.0  34248400.0  1994500.0
2014-12-15  67218100.0   6500300.0  29247800.0  2813400.0
2014-12-16  60790700.0   6782600.0  47801400.0  3964200.0
2014-12-17  53411800.0   5131000.0  34970900.0  2883100.0
2014-12-18  59006200.0   7302400.0  40105600.0  2926700.0
2014-12-19  88429800.0   8864900.0  64551200.0  3690200.0
2014-12-22  45167500.0   4682500.0  26566000.0  2723700.0
2014-12-23  26028400.0   4043300.0  23648100.0  2197600.0
2014-12-24  14479600.0   1868100.0  11437800.0   705900.0
2014-12-26  33721000.0   1912200.0  13197800.0  1040500.0
2014-12-29  27598900.0   3331800.0  14439500.0  2278500.0
2014-12-30  29881500.0   2829900.0  16384700.0   876200.0
...                ...         ...         ...        ...
2019-10-07  30576500.0   2426500.0  15303700.0   842900.0
2019-10-08  27955000.0   3225400.0  25550500.0  1039300.0
2019-10-09  18692600.0   2620800.0  19749900.0   867700.0
2019-10-10  28253400.0   2593700.0  17654600.0   846600.0
2019-10-11  41698900.0   2996800.0  25446000.0  1272700.0
2019-10-14  24106900.0   2309500.0  13304300.0   867500.0
2019-10-15  21840000.0   3025500.0  19695700.0  1381700.0
2019-10-16  18475800.0   5332600.0  20751600.0  1094600.0
2019-10-17  16896300.0  15759800.0  21460600.0   952400.0
2019-10-18  24358400.0   7177500.0  32273500.0  1352800.0
2019-10-21  21811800.0   6306100.0  20078200.0  1027200.0
2019-10-22  20573400.0   4161600.0  27431000.0  1023800.0
2019-10-23  18957200.0   3610900.0  29844600.0   911500.0
2019-10-24  17318800.0   2598500.0  37029300.0  1028100.0
2019-10-25  18369300.0   2579100.0  25959700.0  1213100.0
2019-10-28  24143200.0   3225700.0  35280100.0  2613200.0
2019-10-29  35709900.0   4160700.0  20589500.0  1886400.0
2019-10-30  31130500.0   2252700.0  18496600.0  1408900.0
2019-10-31  34790500.0   3412100.0  24605100.0  1455700.0
2019-11-01  37781300.0   3089800.0  33128400.0  1670100.0
2019-11-04  25818000.0   3335400.0  16912000.0  1501000.0
2019-11-05  19974400.0   3015000.0  18250200.0  1282700.0
2019-11-06  18966100.0   4477300.0  16575800.0  1152700.0
2019-11-07  23735100.0   4073800.0  17786700.0  2030000.0
2019-11-08  17496600.0   2278400.0  16732700.0  1251400.0
2019-11-11  20455300.0   2568000.0  14362600.0  1011900.0
2019-11-12  21847200.0   3046500.0  18641600.0  1085900.0
2019-11-13  25683600.0   2918400.0  16919200.0   826700.0
2019-11-14  22295700.0   4231300.0  19729800.0  1193500.0
2019-11-15  25051600.0   3262500.0  23485700.0  1782600.0

[1259 rows x 4 columns]

In [37]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-11-11  0.007919 -0.015551  0.001028 -0.009288
2019-11-12 -0.000915  0.000886  0.006570 -0.000300
2019-11-13  0.009582 -0.008186  0.001632 -0.000616
2019-11-14 -0.006919 -0.003569  0.005091  0.010370
2019-11-15  0.011879  0.002985  0.012900  0.017850

In [39]:
returns['MSFT'].corr(returns['IBM'])

0.48663091549841203

In [40]:
returns['MSFT'].cov(returns['IBM'])

9.396741173649828e-05

In [41]:
returns.MSFT.corr(returns.IBM)

0.48663091549841203

In [42]:
#full correlation
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.405249  0.570746  0.522941
IBM   0.405249  1.000000  0.486631  0.414454
MSFT  0.570746  0.486631  1.000000  0.657691
GOOG  0.522941  0.414454  0.657691  1.000000

In [44]:
#full covariance
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000247  0.000083  0.000133  0.000125
IBM   0.000083  0.000170  0.000094  0.000082
MSFT  0.000133  0.000094  0.000219  0.000148
GOOG  0.000125  0.000082  0.000148  0.000231

In [45]:
returns.corrwith(returns.IBM)

AAPL    0.405249
IBM     1.000000
MSFT    0.486631
GOOG    0.414454
dtype: float64

In [46]:
returns.corrwith(volume)

AAPL   -0.122283
IBM    -0.132395
MSFT   -0.086259
GOOG   -0.007106
dtype: float64

## Unique Values, Value Counts, and Membership

In [48]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [49]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [50]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [53]:
pd.value_counts(obj.values, sort='False')

a    3
c    3
b    2
d    1
dtype: int64

In [54]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [56]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [57]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [58]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [59]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [60]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [61]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [62]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0